In [1]:
import pandas as pd

from pandas import Series, DataFrame

import numpy as np

In [3]:
object1 = Series( [4, 5, -3, 6])
object1

0    4
1    5
2   -3
3    6
dtype: int64

In [5]:
object2 = Series( [4,5,-3,6] ,index=['d','a','c','b'])
object2

d    4
a    5
c   -3
b    6
dtype: int64

In [6]:
object2[ ['a','d'] ]

a    5
d    4
dtype: int64

In [7]:
object2[object2 > 0]

d    4
a    5
b    6
dtype: int64

In [8]:
data = {
    'state': ['oh','oh','oh','Nev','Nev'],
    'year': [2000,2001,2002,2001,2002],
    'population':[1.5,1.7,2.3,2.9,3.2]
}

In [9]:
data

{'state': ['oh', 'oh', 'oh', 'Nev', 'Nev'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'population': [1.5, 1.7, 2.3, 2.9, 3.2]}

In [11]:
dataframe = DataFrame(data)
dataframe

  state  year  population
0    oh  2000         1.5
1    oh  2001         1.7
2    oh  2002         2.3
3   Nev  2001         2.9
4   Nev  2002         3.2

In [13]:
DataFrame(data, columns=['year', 'state', 'population'])

   year state  population
0  2000    oh         1.5
1  2001    oh         1.7
2  2002    oh         2.3
3  2001   Nev         2.9
4  2002   Nev         3.2

In [15]:
dataframe2 = DataFrame(data, columns=['year', 'state', 'population','debt'],
                      index=['one','two','three','four','five'])
dataframe2

       year state  population debt
one    2000    oh         1.5  NaN
two    2001    oh         1.7  NaN
three  2002    oh         2.3  NaN
four   2001   Nev         2.9  NaN
five   2002   Nev         3.2  NaN

In [17]:
s1 = pd.Series([1,3,5,np.nan,6,8])
s1

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [21]:
dates = pd.date_range('20190101', periods=6)
dates

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2019-01-01  0.741352  1.375333 -0.326445  0.061439
2019-01-02 -0.421128 -0.308336 -0.413650 -0.034671
2019-01-03 -0.912320 -0.705391 -1.473433  0.620189
2019-01-04  1.563913 -0.814657 -1.185064  2.668610
2019-01-05 -0.035557 -1.013739 -1.170276  0.125638
2019-01-06 -0.383558 -1.855147  0.604000  1.236700

In [25]:
df2 = pd.DataFrame({
    'A':1.,
    'B':pd.Timestamp('20190101'),
    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
    'D':np.array([3]*4,dtype='int32'),
    'E':pd.Categorical(["test","train","test","train"]),
    'F':'foo'
})

df2

     A          B    C  D      E    F
0  1.0 2019-01-01  1.0  3   test  foo
1  1.0 2019-01-01  1.0  3  train  foo
2  1.0 2019-01-01  1.0  3   test  foo
3  1.0 2019-01-01  1.0  3  train  foo

In [32]:
df.head()

                   A         B         C         D
2019-01-01  0.741352  1.375333 -0.326445  0.061439
2019-01-02 -0.421128 -0.308336 -0.413650 -0.034671
2019-01-03 -0.912320 -0.705391 -1.473433  0.620189
2019-01-04  1.563913 -0.814657 -1.185064  2.668610
2019-01-05 -0.035557 -1.013739 -1.170276  0.125638

In [33]:
df.tail(2)

                   A         B         C         D
2019-01-05 -0.035557 -1.013739 -1.170276  0.125638
2019-01-06 -0.383558 -1.855147  0.604000  1.236700

In [34]:
df.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [35]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [36]:
df.values

array([[ 0.74135176,  1.37533322, -0.32644457,  0.06143886],
       [-0.42112751, -0.30833598, -0.41364995, -0.03467084],
       [-0.9123202 , -0.70539147, -1.47343305,  0.62018895],
       [ 1.56391262, -0.81465691, -1.18506425,  2.66860953],
       [-0.03555687, -1.01373926, -1.17027575,  0.12563771],
       [-0.38355785, -1.85514721,  0.60400036,  1.23669991]])

In [39]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.092117 -0.553656 -0.660811  0.779651
std    0.905822  1.074977  0.770375  1.040112
min   -0.912320 -1.855147 -1.473433 -0.034671
25%   -0.411735 -0.963969 -1.181367  0.077489
50%   -0.209557 -0.760024 -0.791963  0.372913
75%    0.547125 -0.407600 -0.348246  1.082572
max    1.563913  1.375333  0.604000  2.668610

In [40]:
df.T

   2019-01-01  2019-01-02  2019-01-03  2019-01-04  2019-01-05  2019-01-06
A    0.741352   -0.421128   -0.912320    1.563913   -0.035557   -0.383558
B    1.375333   -0.308336   -0.705391   -0.814657   -1.013739   -1.855147
C   -0.326445   -0.413650   -1.473433   -1.185064   -1.170276    0.604000
D    0.061439   -0.034671    0.620189    2.668610    0.125638    1.236700

In [41]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2019-01-01  0.061439 -0.326445  1.375333  0.741352
2019-01-02 -0.034671 -0.413650 -0.308336 -0.421128
2019-01-03  0.620189 -1.473433 -0.705391 -0.912320
2019-01-04  2.668610 -1.185064 -0.814657  1.563913
2019-01-05  0.125638 -1.170276 -1.013739 -0.035557
2019-01-06  1.236700  0.604000 -1.855147 -0.383558

In [42]:
df.sort_index(axis=1)

                   A         B         C         D
2019-01-01  0.741352  1.375333 -0.326445  0.061439
2019-01-02 -0.421128 -0.308336 -0.413650 -0.034671
2019-01-03 -0.912320 -0.705391 -1.473433  0.620189
2019-01-04  1.563913 -0.814657 -1.185064  2.668610
2019-01-05 -0.035557 -1.013739 -1.170276  0.125638
2019-01-06 -0.383558 -1.855147  0.604000  1.236700

In [43]:
df.sort_values(by='B')

                   A         B         C         D
2019-01-06 -0.383558 -1.855147  0.604000  1.236700
2019-01-05 -0.035557 -1.013739 -1.170276  0.125638
2019-01-04  1.563913 -0.814657 -1.185064  2.668610
2019-01-03 -0.912320 -0.705391 -1.473433  0.620189
2019-01-02 -0.421128 -0.308336 -0.413650 -0.034671
2019-01-01  0.741352  1.375333 -0.326445  0.061439